---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LinesOverlapError
source: html/545574a8-2b97-cfca-43af-3b0e88b65ec5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LinesOverlapError Property

Cannot have overlapping lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId LinesOverlapError { get; }
```